In [1]:
#-----------------------------------------------------------
# 결측치 처리 - (1) 치환
# seaborn에서 제공하는 titanic 데이터 사용
#------------------------------------------------------------
import pandas as pd
import seaborn as sns
import numpy as np

In [67]:
# 데이터 로딩-------------------------------------------
# load_dataset()
titanicDF=sns.load_dataset('titanic')

In [68]:
#데이터 확인----------------------------------------------------
titanicDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [69]:
# 실제데이터 확인---------------------------------------------------
# 이 데이터로 내가 무엇을 분석할 것인지 확인해야함
titanicDF.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [70]:
# 결측치 체크 ========================================================
missingSR=titanicDF.isnull().sum()
type(missingSR)

pandas.core.series.Series

In [71]:
# 결측치가 존재하는 데이터만 추출
# 비교연산자랑 함께 사용해서 결과가 True, False 반환
# True, False로 구성된 데이터를 불린인덱싱(boolean indexing)
FILLTER=missingSR>0

MASK=missingSR>100

missingSR[FILLTER], missingSR[MASK]

(age            177
 embarked         2
 deck           688
 embark_town      2
 dtype: int64,
 age     177
 deck    688
 dtype: int64)

In [72]:
# 결측치가 존재하는 컬럼에 값을 치환해서 결측치 없애기--------------------------------------------
# => fillna()메서드
missingSR[FILLTER].index

Index(['age', 'embarked', 'deck', 'embark_town'], dtype='object')

In [73]:
# age컬럼 결측치 처리 및 확인------------------------------------------------------
# filla(치환값)=> 본인이 결정한 값
# 0으로 처리
titanicDF['age'].fillna(0)
print('-'*50)
# 확인
titanicDF['age'].fillna(0).isnull().sum()

#titanicDF['age']=titanicDF['age'].fillna(0).isnull().sum()

titanicDF.age.mean()

--------------------------------------------------

29.69911764705882

In [74]:
# filla(치환값)=> 본인이 결정한 값  평균 => mean()
titanicDF['age'].fillna(0)
titanicDF.age.mean()

29.69911764705882

In [75]:
# filla(치환값) => 본인이 결정 최빈값 => mode()
titanicDF['age'].fillna(titanicDF.age.mode())
# modeValue = titanicDF['age'].mode()
# titanicDF['age'].filla(modeValue[0])

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [76]:
# fillna(치환값) => method 매개변수 = 'ffill', 'bfill' => 앞 행의 나이 값으로 채우기
titanicDF['age'].fillna(method='ffill')

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    19.0
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [77]:
# fillna(치환값) => method 매개변수 = 'ffill', 'bfill' => 앞 행의 나이 값으로 채우기
titanicDF['age'].fillna(method='bfill')

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    26.0
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [78]:
#-----------------------------------------------------------
titanicDF.mode()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,24.0,0,0,8.05,S,Third,man,True,C,Southampton,no,True

In [79]:
titanicDF.survived.value_counts(), titanicDF.pclass.value_counts()

(0    549
 1    342
 Name: survived, dtype: int64,
 3    491
 1    216
 2    184
 Name: pclass, dtype: int64)

In [80]:
FILE='../dataFiles/dataFiles/auto-mpg.csv'
mpgDF=pd.read_csv(FILE)

In [81]:
mpgDF.mode()

   18.0    8  307.0   76.0   3504.  12.0    70    1 chevrolet chevelle malibu
0  13.0  4.0   97.0  150.0  1985.0  14.5  73.0  1.0                ford pinto
1   NaN  NaN    NaN  90.00  2130.0   NaN   NaN  NaN                       NaN

In [82]:
mpgDF['18.0'].value_counts(), mpgDF['18.0'].mode()[0]

(13.0    20
 14.0    19
 15.0    16
 18.0    16
 26.0    14
         ..
 31.9     1
 16.9     1
 18.2     1
 22.3     1
 44.0     1
 Name: 18.0, Length: 129, dtype: int64,
 13.0)